In [4]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import os

In [5]:
os.chdir("E:\Pandas")

In [6]:
df = pd.read_csv("weather_data.csv")
df

         day  temp condition    city
0     Monday    12     Sunny  Mumbai
1    Tuesday    14      Rain    Pune
2  Wednesday    15      Rain  Mumbai
3   Thursday    14    Cloudy    Pune
4     Friday    21     Sunny  Mumbai
5   Saturday    22     Sunny  Mumbai
6     Sunday    24     Sunny    Pune

In [8]:
x = df.groupby("city")
x.get_group("Mumbai")

         day  temp condition    city
0     Monday    12     Sunny  Mumbai
2  Wednesday    15      Rain  Mumbai
4     Friday    21     Sunny  Mumbai
5   Saturday    22     Sunny  Mumbai

In [9]:
x.get_group("Pune")

        day  temp condition  city
1   Tuesday    14      Rain  Pune
3  Thursday    14    Cloudy  Pune
6    Sunday    24     Sunny  Pune

In [11]:
y = df.groupby("condition")
y.get_group("Rain")

         day  temp condition    city
1    Tuesday    14      Rain    Pune
2  Wednesday    15      Rain  Mumbai

In [15]:
for city, data in x:
    print("City is: ", city)
    print("\n")
    print("data: ", data)

City is:  Mumbai


data:           day  temp condition    city
0     Monday    12     Sunny  Mumbai
2  Wednesday    15      Rain  Mumbai
4     Friday    21     Sunny  Mumbai
5   Saturday    22     Sunny  Mumbai
City is:  Pune


data:          day  temp condition  city
1   Tuesday    14      Rain  Pune
3  Thursday    14    Cloudy  Pune
6    Sunday    24     Sunny  Pune

In [18]:
print(data)

        day  temp condition  city
1   Tuesday    14      Rain  Pune
3  Thursday    14    Cloudy  Pune
6    Sunday    24     Sunny  Pune

In [19]:
x.max()

              day  temp condition
city
Mumbai  Wednesday    22     Sunny
Pune      Tuesday    24     Sunny

In [20]:
x.describe()

        temp
       count       mean       std   min    25%   50%    75%   max
city
Mumbai   4.0  17.500000  4.795832  12.0  14.25  18.0  21.25  22.0
Pune     3.0  17.333333  5.773503  14.0  14.00  14.0  19.00  24.0